Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.ItemTypeEnum Enumeration
 The item types.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ItemTypeEnum
Public Enumeration ItemTypeEnum
Members
Member name | Value | Description
ITEM_TYPE_UNKNOWN | 0 |  The item type is unknown.
ITEM_TYPE_BAR | 1 |  The bar item type.
ITEM_TYPE_AREA | 2 |  The area item type.
ITEM_TYPE_VOLUME | 3 |  The volume item type.
See Also
Reference
Tekla.Structures.Analysis Namespace